In [1]:
import pandas as pd

df = pd.DataFrame({
    "col1": [1, 2, 3, 4],
    "col2": [5, 6, 7, 8],
    "col3": [9, 10, 11, 12]
})
df

   col1  col2  col3
0     1     5     9
1     2     6    10
2     3     7    11
3     4     8    12

In [2]:
df["col4"] = "a b c d".split()
df

   col1  col2  col3 col4
0     1     5     9    a
1     2     6    10    b
2     3     7    11    c
3     4     8    12    d

In [4]:
df_corr = df.corr(numeric_only=True)['col3'].sort_values(ascending=False)
df_corr

col1    1.0
col2    1.0
col3    1.0
Name: col3, dtype: float64